yangliangquan/ChibiOS/os/hal/ports/CH32/LLD/DMAv1/ch32_dma.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    DMAv1/ch32_dma.h
 * @brief   DMA helper driver header.
 * @note    This driver uses the new naming convention used for the CH32F2xx
 *          so the "DMA channels" are referred as "DMA streams".
 *
 * @addtogroup CH32_DMA
 * @{
 */

#ifndef CH32_DMA_H
#define CH32_DMA_H

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   DMA capability.
 * @details if @p TRUE then the DMA is able of burst transfers, FIFOs,
 *          scatter gather and other advanced features.
 */
#define CH32_DMA_ADVANCED          FALSE

/**
 * @brief   Maximum number of transfers in a single operation.
 */
#define CH32_DMA_MAX_TRANSFER      65535

/**
 * @brief   Total number of DMA streams.
 * @details This is the total number of streams among all the DMA units.
 */
#define CH32_DMA_STREAMS           (CH32_DMA1_NUM_CHANNELS +              \
                                     CH32_DMA2_NUM_CHANNELS)

/**
 * @brief   Mask of the ISR bits passed to the DMA callback functions.
 */
#define CH32_DMA_ISR_MASK          0x0F

/**
 * @brief   Returns the request line associated to the specified stream.
 * @note    In some CH32 manuals the request line is named confusingly
 *          channel.
 *
 * @param[in] id        the unique numeric stream identifier
 * @param[in] c         a stream/request association word, one request per
 *                      nibble
 * @return              Returns the request associated to the stream.
 */
#define CH32_DMA_GETCHANNEL(id, c)                                         \
  (((uint32_t)(c) >> (((uint32_t)(id) % (uint32_t)CH32_DMA1_NUM_CHANNELS) * 4U)) & 15U)

/**
 * @brief   Checks if a DMA priority is within the valid range.
 * @param[in] prio      DMA priority
 *
 * @retval              The check result.
 * @retval false        invalid DMA priority.
 * @retval true         correct DMA priority.
 */
#define CH32_DMA_IS_VALID_PRIORITY(prio) (((prio) >= 0U) && ((prio) <= 3U))

#if (CH32_DMA_SUPPORTS_DMAMUX == FALSE) || defined(_DOXYGEN__)
/**
 * @brief   Checks if a DMA stream id is within the valid range.
 *
 * @param[in] id        DMA stream id
 * @retval              The check result.
 * @retval false        invalid DMA channel.
 * @retval true         correct DMA channel.
 */
#define CH32_DMA_IS_VALID_STREAM(id) (((id) >= 0U) &&                      \
                                       ((id) < CH32_DMA_STREAMS))
#else /* CH32_DMA_SUPPORTS_DMAMUX == FALSE */
#if CH32_DMA2_NUM_CHANNELS > 0
#define CH32_DMA_IS_VALID_STREAM(id) (((id) >= 0U) &&                      \
                                       ((id) <= (CH32_DMA_STREAMS + 2)))
#else
#define CH32_DMA_IS_VALID_STREAM(id) (((id) >= 0U) &&                      \
                                       ((id) <= (CH32_DMA_STREAMS + 1)))
#endif
#endif /* CH32_DMA_SUPPORTS_DMAMUX == FALSE */

/**
 * @brief   Returns an unique numeric identifier for a DMA stream.
 *
 * @param[in] dma       the DMA unit number
 * @param[in] stream    the stream number
 * @return              An unique numeric stream identifier.
 */
#define CH32_DMA_STREAM_ID(dma, stream)                                    \
  ((((dma) - 1) * CH32_DMA1_NUM_CHANNELS) + ((stream) - 1))

/**
 * @brief   Returns a DMA stream identifier mask.
 *
 *
 * @param[in] dma       the DMA unit number
 * @param[in] stream    the stream number
 * @return              A DMA stream identifier mask.
 */
#define CH32_DMA_STREAM_ID_MSK(dma, stream)                                \
  (1U << CH32_DMA_STREAM_ID(dma, stream))

/**
 * @brief   Checks if a DMA stream unique identifier belongs to a mask.
 *
 * @param[in] id        the stream numeric identifier
 * @param[in] mask      the stream numeric identifiers mask
 *
 * @retval              The check result.
 * @retval false        id does not belong to the mask.
 * @retval true         id belongs to the mask.
 */
#define CH32_DMA_IS_VALID_ID(id, mask) (((1U << (id)) & (mask)))

#if (CH32_DMA_SUPPORTS_DMAMUX == TRUE) || defined(_DOXYGEN__)
/**
 * @name    Special stream identifiers
 * @{
 */
#define CH32_DMA_STREAM_ID_ANY         CH32_DMA_STREAMS
#define CH32_DMA_STREAM_ID_ANY_DMA1    (CH32_DMA_STREAM_ID_ANY + 1)
#if CH32_DMA2_NUM_CHANNELS > 0
#define CH32_DMA_STREAM_ID_ANY_DMA2    (CH32_DMA_STREAM_ID_ANY_DMA1 + 1)
#endif
/** @} */
#endif

/**
 * @name    DMA streams identifiers
 * @{
 */
/**
 * @brief   Returns a pointer to a ch32_dma_stream_t structure.
 *
 * @param[in] id        the stream numeric identifier
 * @return              A pointer to the ch32_dma_stream_t constant structure
 *                      associated to the DMA stream.
 */
#define CH32_DMA_STREAM(id)        (&_ch32_dma_streams[id])

#if CH32_DMA1_NUM_CHANNELS > 0
#define CH32_DMA1_STREAM1          CH32_DMA_STREAM(0)
#endif
#if CH32_DMA1_NUM_CHANNELS > 1
#define CH32_DMA1_STREAM2          CH32_DMA_STREAM(1)
#endif
#if CH32_DMA1_NUM_CHANNELS > 2
#define CH32_DMA1_STREAM3          CH32_DMA_STREAM(2)
#endif
#if CH32_DMA1_NUM_CHANNELS > 3
#define CH32_DMA1_STREAM4          CH32_DMA_STREAM(3)
#endif
#if CH32_DMA1_NUM_CHANNELS > 4
#define CH32_DMA1_STREAM5          CH32_DMA_STREAM(4)
#endif
#if CH32_DMA1_NUM_CHANNELS > 5
#define CH32_DMA1_STREAM6          CH32_DMA_STREAM(5)
#endif
#if CH32_DMA1_NUM_CHANNELS > 6
#define CH32_DMA1_STREAM7          CH32_DMA_STREAM(6)
#endif
#if CH32_DMA1_NUM_CHANNELS > 7
#define CH32_DMA1_STREAM8          CH32_DMA_STREAM(7)
#endif
#if CH32_DMA2_NUM_CHANNELS > 0
#define CH32_DMA2_STREAM1          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 0)
#endif
#if CH32_DMA2_NUM_CHANNELS > 1
#define CH32_DMA2_STREAM2          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 1)
#endif
#if CH32_DMA2_NUM_CHANNELS > 2
#define CH32_DMA2_STREAM3          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 2)
#endif
#if CH32_DMA2_NUM_CHANNELS > 3
#define CH32_DMA2_STREAM4          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 3)
#endif
#if CH32_DMA2_NUM_CHANNELS > 4
#define CH32_DMA2_STREAM5          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 4)
#endif
#if CH32_DMA2_NUM_CHANNELS > 5
#define CH32_DMA2_STREAM6          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 5)
#endif
#if CH32_DMA2_NUM_CHANNELS > 6
#define CH32_DMA2_STREAM7          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 6)
#endif
#if CH32_DMA2_NUM_CHANNELS > 7
#define CH32_DMA2_STREAM8          CH32_DMA_STREAM(CH32_DMA1_NUM_CHANNELS + 7)
#endif
/** @} */

/* DMA_data_transfer_direction */
#define DMA_DIR_PeripheralDST              ((uint32_t)0x00000010)
#define DMA_DIR_PeripheralSRC              ((uint32_t)0x00000000)

/* DMA_peripheral_incremented_mode */
#define DMA_PeripheralInc_Enable           ((uint32_t)0x00000040)
#define DMA_PeripheralInc_Disable          ((uint32_t)0x00000000)
											
/* DMA_memory_incremented_mode */
#define DMA_MemoryInc_Enable               ((uint32_t)0x00000080)
#define DMA_MemoryInc_Disable              ((uint32_t)0x00000000)
										
/* DMA_peripheral_data_size */
#define DMA_PeripheralDataSize_Byte        ((uint32_t)0x00000000)
#define DMA_PeripheralDataSize_HalfWord    ((uint32_t)0x00000100)
#define DMA_PeripheralDataSize_Word        ((uint32_t)0x00000200)
#define DMA_PeripheralDataSize_256         ((uint32_t)0x00000300)

/* DMA_memory_data_size */
#define DMA_MemoryDataSize_Byte            ((uint32_t)0x00000000)
#define DMA_MemoryDataSize_HalfWord        ((uint32_t)0x00000400)
#define DMA_MemoryDataSize_Word            ((uint32_t)0x00000800)
#define DMA_MemoryDataSize_256             ((uint32_t)0x00000C00)

